InformationRegisters/КешИнформацииОбОбъектах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>КешИнформацииОбОбъектах</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЕстьЗадачи</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиЭП</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьКатегории</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьОшибкиПриемкиОтправкиПочты</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьФайлы</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправленОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отозван</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Переслан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Перенаправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолученОтвет</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПолученПоСВД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеСВД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СостояниеКонтроля</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СостоянияКонтроля</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СтатусЭП</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусПроверкиЭП</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокИсполненияОбщий</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаИсполнения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВероятностьКТ</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВероятностиКТ</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗначенияПараметровHTML.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЗначенияПараметровHTML</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументУстановкиЗначенияПараметраПриема</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ДанныеТаблицШаблоновПриема.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДанныеТаблицШаблоновПриема</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:TypeSet>cfg:Characteristic.ПараметрыHTML</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТаблицаШаблонов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТаблицыШаблоновПриема</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерСтрокиТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Параметр</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.ПараметрыHTML</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДокументУстановкиЗначенияПараметраПриема</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИндексШаблона</Name>
					<Comment>Индекс строки шаблона приема в документе</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>6</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УдалитьНомерСтрокиРодительскойТаблицы</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторСтроки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторСтрокой</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРодительскойСтроки</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.УникальныйИдентификаторСтрокой</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПодписиМО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПодписиМО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>Филиал</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
						<v8:Type>cfg:CatalogRef.Филиалы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СертификатыКлючейЭлектроннойПодписиИШифрования</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЭлектронныеПодписи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ЭлектронныеПодписи</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Версия</Name>
					<Comment>Версия набора ключевых реквизитов для подписания</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПроверкиПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИмяФайлаПодписи</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>260</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КомуВыданСертификат</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отпечаток</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>28</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подпись</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписьВерна</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сертификат</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СертификатДействителен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиПодписи</Name>
					<Comment>Заполнено только в том случае, если подпись неверна</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ТекстОшибкиПроверкиСертификата</Name>
					<Comment>Заполнено только в том случае, если сертификат недействителен</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаПодписи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УстановившийПодпись</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПодписанФайлЭМД</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>УникальныйИдентификатор</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Подписанный объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПодписанныйОбъект</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПорядковыйНомер</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/РолиИПодписиЭМД.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>РолиИПодписиЭМД</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>УИД_ЭЦП</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДополнительныеДанные</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>512</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Документ</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ПодписанныйОбъект</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РольПодписи</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.РолиПриПодписиМедДокументов</v8:Type>
						<v8:Type>cfg:EnumRef.РолиПодписей</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>УИД_ЭМД</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторРоли</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/СтатусПроверкиЭП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусПроверкиЭП</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПодписьДействительна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписьНедействительна</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписьНеПроверена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПодписиНет</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

CommonModules/ЭЦП_УМЦ_Сервер/Ext/Module.bsl
#Область ОбщиеФункцииИПроверки

Функция ИспользоватьЭлектронныеПодписиЭМК() Экспорт
	
	Возврат ЭлектроннаяПодпись.ИспользоватьЭлектронныеПодписи() И УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("ИспользоватьЭлектронныеПодписиЭМК");
	
КонецФункции

Функция ОбъектПодписываетсяЭЦП(СсылкаИлиТип) Экспорт
	
	Если ТипЗнч(СсылкаИлиТип) = Тип("Тип") Тогда
		Тип = СсылкаИлиТип;
	Иначе
		Тип = ТипЗнч(СсылкаИлиТип);
	КонецЕсли;
	
	Возврат Метаданные.ОпределяемыеТипы.ПодписанныйОбъект.Тип.СодержитТип(Тип);
	
КонецФункции

Функция ПроверитьНеобходимостьПроверятьПодпись(Ссылка) Экспорт
	
	Возврат ИспользоватьЭлектронныеПодписиЭМК() И ОбъектПодписываетсяЭЦП(Ссылка) И Ссылка.ПодписанЭП;
	
КонецФункции

Функция ДокументПодписан(ДокументСсылка) Экспорт
	
	Перем Результат;
	
	КешИнформации = РегистрыСведений.КешИнформацииОбОбъектах.СоздатьМенеджерЗаписи();
	КешИнформации.Объект = ДокументСсылка;
	КешИнформации.Прочитать();
	
	Если КешИнформации.СтатусЭП = Перечисления.СтатусПроверкиЭП.ПодписиНет Тогда
		// Не подписан электронной подписью;
		Результат = Ложь;
	ИначеЕсли КешИнформации.СтатусЭП = Перечисления.СтатусПроверкиЭП.ПодписьНеПроверена Тогда
		// Подписан электронной подписью. Подпись не проверена
		Результат = Ложь;
	ИначеЕсли КешИнформации.СтатусЭП = Перечисления.СтатусПроверкиЭП.ПодписьДействительна Тогда
		// Подписан электронной подписью. Подпись действительна
		Результат = Истина;
	ИначеЕсли КешИнформации.СтатусЭП = Перечисления.СтатусПроверкиЭП.ПодписьНедействительна Тогда
		// Подписан электронной подписью. Подпись недействительна.
		Результат = Ложь
	Иначе
		Если ДокументСсылка.ПодписанЭП Тогда
			// Подписан электронной подписью. Подпись не проверена
			Результат = Ложь
		Иначе
			// Не подписан электронной подписью
			Результат = Ложь
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти

#Область ФормированиеДанныхОбъектаДляПодписи

Функция ПолучитьАктуальныйНомерВерсииПодписываемыхДанных(ТипОбъекта = Неопределено) Экспорт
	
	Если ТипОбъекта = Тип("ДокументСсылка.Прием") Тогда
		Возврат 3;
	КонецЕсли;
	
	Возврат 0;
	
КонецФункции

Функция СформироватьДанныеФайловОбъектаДляПодписи(Ссылка, Версия, ХешироватьДанные = Истина, ФункцияХеш = Неопределено) Экспорт
	
	Если Версия = Неопределено Тогда
		Версия = ПолучитьАктуальныйНомерВерсииПодписываемыхДанных(Тип("ДокументСсылка.Прием"));
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Ссылка КАК Ссылка,
		|	ХранилищеДополнительнойИнформации.ВФайле,
		|	ХранилищеДополнительнойИнформации.Наименование,
		|	ХранилищеДополнительнойИнформации.Хранилище
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект = &Объект
		|	И НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	Результат = Запрос.Выполнить();
	
	Если Результат.Пустой() Тогда
		Возврат "";
	КонецЕсли;
	
	ДанныеBase64 = "";
	Если ХешироватьДанные Тогда
		Если ФункцияХеш = Неопределено Тогда
			ФункцияХеш = ХешФункция.SHA256;
		КонецЕсли;
		ХешированиеДанных = Новый ХешированиеДанных(ФункцияХеш);
	КонецЕсли;
	
	БазовыйКаталог = РаботаСФайлами.ПолучитьБазовыйКаталогФайлов(Ссылка);
	
	ВыборкаФайлы = Результат.Выбрать();
	Пока ВыборкаФайлы.Следующий() Цикл
		ДанныеФайла = РаботаСФайлами.ПолучитьФайлНаСервере(ВыборкаФайлы.Ссылка, БазовыйКаталог, Истина);
		Если ДанныеФайла.ФайлНайден И ДанныеФайла.ДвоичныеДанные <> Неопределено Тогда
			Если ХешироватьДанные Тогда
				ХешированиеДанных.Добавить(ДанныеФайла.ДвоичныеДанные);
			Иначе
				ДанныеBase64 = ДанныеBase64 + Base64Строка(ДанныеФайла.ДвоичныеДанные);
			КонецЕсли;
		Иначе
			Если ХешироватьДанные Тогда
				ХешированиеДанных.Добавить("Файл отсутствует");
			Иначе
				ДанныеBase64 = ДанныеBase64 + "Файл отсутствует";
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;
	
	Если ХешироватьДанные Тогда
		Возврат ЗначениеСтрокой(ХешированиеДанных.ХешСумма, "ХешФайлов");
	Иначе
		Возврат ЗначениеСтрокой(ДанныеBase64, "ДанныеФайлов");
	КонецЕсли;
	
КонецФункции

Функция СформироватьДанныеПриема(Ссылка, Версия, ПараметрыПриема) Экспорт
	
	Если Версия = 2 Тогда
		Возврат СформироватьХешПриемаВерсия2(Ссылка);
	КонецЕсли;
	
	ДанныеПриемаСтрокой = "";
	Прием = Ссылка.ПолучитьОбъект();
	
	ДанныеПриемаСтрокой = 
		ЗначениеСтрокой(Прием.Ссылка, "Прием") +
		ЗначениеСтрокой(НачалоДня(Прием.Дата), "Дата") +
		ЗначениеСтрокой(Прием.Клиент, "Клиент") +
		ЗначениеСтрокой(Прием.Врач, "Врач") +
		ЗначениеСтрокой(Прием.МедицинскаяКарта, "Медкарта") +
		ЗначениеСтрокой(Прием.Филиал, "Клиника") +
		ЗначениеСтрокой(Прием.УдалитьТипЭМПЗ, "ТипЭМПЗ") +
		ЗначениеСтрокой(Прием.ПометкаУдаления) +
		ЗначениеСтрокой(Прием.НуждаетсяВПроведенииДопОбследования) +
		ЗначениеСтрокой(Прием.НуждаетсяВОбследованииВЦентреПрофпатологии) +
		ЗначениеСтрокой(Прием.НуждаетсяВАмбулаторномОбследованииИЛечении) +
		ЗначениеСтрокой(Прием.НуждаетсяВСтационарномОбследованииИЛечении) +
		ЗначениеСтрокой(Прием.НуждаетсяВСанаторноКурортномЛечении) +
		ЗначениеСтрокой(Прием.НуждаетсяВДиспансерномНаблюдении);
	
	ЭЦП_СерверПереопределяемый.ДополнитьДаннымиПриема(ДанныеПриемаСтрокой, Прием);
	
	// Диагнозы
	ТаблицаДиагнозов = Прием.Диагнозы.Выгрузить();
	ОтраслевыеДополнения.СвернутьТаблицуДиагнозов(ТаблицаДиагнозов);
	ТаблицаДиагнозов.Сортировать("Диагноз");
	Для Каждого СтрокаДиагноз Из ТаблицаДиагнозов Цикл
		
		ДанныеПриемаСтрокой = ДанныеПриемаСтрокой +
			ЗначениеСтрокой(СтрокаДиагноз.Диагноз, "Диагноз") +
			ЗначениеСтрокой(СтрокаДиагноз.Детализация, "Детализация") +
			ЗначениеСтрокой(СтрокаДиагноз.ВыявленВпервые) +
			ЗначениеСтрокой(СтрокаДиагноз.Классификация1, "Классификация1") +
			ЗначениеСтрокой(СтрокаДиагноз.Классификация2, "Классификация2") +
			ЗначениеСтрокой(СтрокаДиагноз.Классификация3, "Классификация3") +
			ЗначениеСтрокой(СтрокаДиагноз.Сопутствующий) +
			ЗначениеСтрокой(СтрокаДиагноз.Травма, "Травма") +
			ЗначениеСтрокой(СтрокаДиагноз.Исход, "Исход");
		
		Если ТаблицаДиагнозов.Колонки.Найти("Профессиональное") <> Неопределено Тогда
			ДанныеПриемаСтрокой = ДанныеПриемаСтрокой + ЗначениеСтрокой(СтрокаДиагноз.Профессиональное);
		КонецЕсли;
	КонецЦикла;
	
	Если Метаданные.Документы.Прием.ТабличныеЧасти.Найти("ВредныеФакторыПротивопоказаний") <> Неопределено Тогда
		// Вредные факторы
		ТаблицаФакторов = Прием.ВредныеФакторыПротивопоказаний.Выгрузить(, "ВредныйФактор");
		ТаблицаФакторов.Свернуть("ВредныйФактор");
		ТаблицаФакторов.Сортировать("ВредныйФактор");
		Для Каждого СтрокаФактор Из Прием.ВредныеФакторыПротивопоказаний Цикл
			
			ДанныеПриемаСтрокой = ДанныеПриемаСтрокой +
				ЗначениеСтрокой(СтрокаФактор.ВредныйФактор, "ВредныйФактор");
			
		КонецЦикла;
	КонецЕсли;
	
	// Значения параметров html
	Если ПараметрыПриема <> Неопределено Тогда
		
		ТаблицаПараметров = ПараметрыПриема.ТаблицаПараметров;
		ТаблицаПараметров.Свернуть("Параметр, Значение");
		ТаблицаПараметров.Сортировать("Параметр");
		Для Каждого СтрокаПараметра Из ТаблицаПараметров Цикл
			Если ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда
				ЗначениеПараметра = СтрокаПараметра.Значение;
				Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
					ЗначениеПараметра = ЗначениеПараметра.Значение;
				КонецЕсли;
				
				ДанныеПриемаСтрокой = ДанныеПриемаСтрокой +
					ЗначениеСтрокой(СтрокаПараметра.Параметр, "ПараметрОсмотра") +
					ЗначениеСтрокой(ЗначениеПараметра, "ЗначениеПараметра");
			КонецЕсли;
		КонецЦикла;
		
		ПараметрыТаблицШаблонов = ПараметрыПриема.ПараметрыТаблицШаблонов;
		ПараметрыТаблицШаблонов.Свернуть("Параметр, НомерСтрокиТаблицы, Значение");
		ПараметрыТаблицШаблонов.Сортировать("НомерСтрокиТаблицы, Параметр");
		Для Каждого СтрокаПараметра Из ПараметрыТаблицШаблонов Цикл
			Если ЗначениеЗаполнено(СтрокаПараметра.Значение) Тогда
				ЗначениеПараметра = СтрокаПараметра.Значение;
				Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
					ЗначениеПараметра = ЗначениеПараметра.Значение;
				КонецЕсли;
				
				ДанныеПриемаСтрокой = ДанныеПриемаСтрокой +
					ЗначениеСтрокой(СтрокаПараметра.Параметр, "ПараметрТаблицыШаблонаОсмотра") +
					ЗначениеСтрокой(ЗначениеПараметра, "ЗначениеПараметраТаблицыШаблона");
			КонецЕсли;
		КонецЦикла;
	Иначе
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ РАЗЛИЧНЫЕ
			|	ЗначенияПараметровHTML.Параметр КАК Параметр,
			|	ЗначенияПараметровHTML.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ЗначенияПараметровHTML КАК ЗначенияПараметровHTML
			|ГДЕ
			|	ЗначенияПараметровHTML.Документ = &Прием
			|
			|УПОРЯДОЧИТЬ ПО
			|	ЗначенияПараметровHTML.Параметр.Наименование";
		Запрос.УстановитьПараметр("Прием", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗначениеПараметра = Выборка.Значение;
			Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
				ЗначениеПараметра = ЗначениеПараметра.Значение;
			КонецЕсли;
			
			ДанныеПриемаСтрокой = ДанныеПриемаСтрокой +
				ЗначениеСтрокой(Выборка.Параметр, "ПараметрОсмотра") +
				ЗначениеСтрокой(ЗначениеПараметра, "ЗначениеПараметра");
		КонецЦикла;
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	ДанныеТаблицШаблоновПриема.Параметр КАК Параметр,
			|	ДанныеТаблицШаблоновПриема.Значение КАК Значение
			|ИЗ
			|	РегистрСведений.ДанныеТаблицШаблоновПриема КАК ДанныеТаблицШаблоновПриема
			|ГДЕ
			|	ДанныеТаблицШаблоновПриема.Документ = &Прием
			|
			|УПОРЯДОЧИТЬ ПО
			|	ДанныеТаблицШаблоновПриема.НомерСтрокиТаблицы,
			|	ДанныеТаблицШаблоновПриема.Параметр.Наименование";
		Запрос.УстановитьПараметр("Прием", Ссылка);
		Выборка = Запрос.Выполнить().Выбрать();
		
		Пока Выборка.Следующий() Цикл
			
			ЗначениеПараметра = Выборка.Значение;
			Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
				ЗначениеПараметра = ЗначениеПараметра.Значение;
			КонецЕсли;
			
			ДанныеПриемаСтрокой = ДанныеПриемаСтрокой +
				ЗначениеСтрокой(Выборка.Параметр, "ПараметрТаблицыШаблонаОсмотра") +
				ЗначениеСтрокой(ЗначениеПараметра, "ЗначениеПараметраТаблицыШаблона");
		КонецЦикла;
	КонецЕсли;
		
	Возврат ДанныеПриемаСтрокой;
	
КонецФункции

Функция ЗначениеСтрокой(Значение, Имя = Неопределено) Экспорт
	
	Возврат доп_СертификатыЭЦП.ПолучитьДанныеОбъектаСтрокой(Значение, Имя, НазначениеТипаXML.Неявное);
	
КонецФункции

Функция СформироватьДанныеПрохожденияМедОсмотра(Ссылка) Экспорт
	
	ДанныеМедОсмотраСтрокой = "";
	ПрохождениеМедОсмотра = Ссылка.ПолучитьОбъект();
	
	ДанныеМедОсмотраСтрокой = 
		ЗначениеСтрокой(ПрохождениеМедОсмотра.Ссылка, "ПрохождениеМедосмотра") +
		ЗначениеСтрокой(НачалоДня(ПрохождениеМедОсмотра.Дата), "Дата") +
		ЗначениеСтрокой(ПрохождениеМедОсмотра.Клиент, "Клиент") +
		ЗначениеСтрокой(ПрохождениеМедОсмотра.ПредседательМедКомиссии, "ПредседательМедКомиссии") +
		ЗначениеСтрокой(ПрохождениеМедОсмотра.ВидПрохожденияМО, "ВидПрохожденияМО") +
		ЗначениеСтрокой(ПрохождениеМедОсмотра.ДатаЗавершения, "ДатаЗавершения");
	
	// Значения параметров html
	ТаблицаПараметров = ПрохождениеМедОсмотра.ПараметрыПриема.Выгрузить();
	Для Каждого СтрокаПараметр Из ТаблицаПараметров Цикл
		
		ЗначениеПараметра = СтрокаПараметр.Значение;
		Если ТипЗнч(ЗначениеПараметра) = Тип("СправочникСсылка.СтрокиЭМКНеограниченнойДлины") Тогда
			ЗначениеПараметра = ЗначениеПараметра.Значение;
		КонецЕсли;
		
		ДанныеМедОсмотраСтрокой = ДанныеМедОсмотраСтрокой +
			ЗначениеСтрокой(СтрокаПараметр.Параметр, "ПараметрОсмотра") +
			ЗначениеСтрокой(ЗначениеПараметра, "ЗначениеПараметра");
	КонецЦикла;
	
	Возврат ДанныеМедОсмотраСтрокой;
	
КонецФункции

Функция СформироватьДанныеМедицинскийОтчет(Ссылка) Экспорт
	
	ДанныеОтчета = Ссылка.ДанныеОтчета.Получить();
	
	СтрокаДляПодписанияXML = "";
	
	Для Каждого Страница Из ДанныеОтчета.ПоказателиОтчета Цикл
		СтраницаXML = "";
		Для Каждого Поле Из Страница.Значение Цикл
			СтраницаXML = СтраницаXML + "<" + Поле.Ключ + ">" + Поле.Значение +"</" + Поле.Ключ + ">";
		КонецЦикла;
		СтрокаДляПодписанияXML = СтрокаДляПодписанияXML + "<" + Страница.Ключ + ">" + СтраницаXML +"</" + Страница.Ключ + ">";
	КонецЦикла;
	
	СтрокаДляПодписанияXML = "<ПоказателиОтчета>" + СтрокаДляПодписанияXML +"</ПоказателиОтчета>";
	
	Возврат СтрокаДляПодписанияXML;
	
КонецФункции

Функция СформироватьДанныеВрачебнойКомиссии(Ссылка) Экспорт
	
	ДанныеВК = Новый Соответствие;
	
	ДанныеВК.Вставить("Документ",						 Строка(Ссылка.УникальныйИдентификатор()));
	ДанныеВК.Вставить("Дата",							 НачалоДня(Ссылка.Дата));
	ДанныеВК.Вставить("Клиент",							 Строка(Ссылка.Клиент.УникальныйИдентификатор()));
	ДанныеВК.Вставить("Цель",							 Строка(Ссылка.Цель.УникальныйИдентификатор()));
	ДанныеВК.Вставить("Заключение",						 Ссылка.Заключение);
	ДанныеВК.Вставить("ДатаНачалаНетрудоспособности",	 Ссылка.ДатаНачалаНетрудоспособности);
	ДанныеВК.Вставить("ДатаОкончанияНетрудоспособности", Ссылка.ДатаОкончанияНетрудоспособности);
	ДанныеВК.Вставить("ПредседательКомиссии",			 Строка(Ссылка.ПредседательКомиссии.УникальныйИдентификатор()));
	ДанныеВК.Вставить("HTMLПредставление",				 Ссылка.HTMLПредставление);
	ДанныеВК.Вставить("МедицинскаяКарта",				 Строка(Ссылка.МедицинскаяКарта.УникальныйИдентификатор()));
	ДанныеВК.Вставить("РассмотренныеВопросы",			 Ссылка.РассмотренныеВопросы);
	ДанныеВК.Вставить("Рекомендации",					 Ссылка.Рекомендации);
	ДанныеВК.Вставить("Жалобы",							 Ссылка.Жалобы);
	ДанныеВК.Вставить("Лечение",						 Ссылка.Лечение);
	
	СоставКомиссии = Новый Массив;
	Для Каждого СтрокаСоставаКомиссии Из Ссылка.СоставКомиссии Цикл
		СоставКомиссии.Добавить(Строка(СтрокаСоставаКомиссии.Сотрудник.УникальныйИдентификатор()));
	КонецЦикла;
	ДанныеВК.Вставить("СоставКомиссии", СоставКомиссии);
	
	Диагнозы = Новый Массив;
	Для Каждого СтрокаДиагноза Из Ссылка.Диагнозы Цикл
		СтруктураДиагноза = Новый Структура;
		СтруктураДиагноза.Вставить("Диагноз", Строка(СтрокаДиагноза.Диагноз.УникальныйИдентификатор()));
		СтруктураДиагноза.Вставить("Описание", СтрокаДиагноза.Описание);
		Диагнозы.Добавить(СтруктураДиагноза);
	КонецЦикла;
	ДанныеВК.Вставить("Диагнозы", Диагнозы);
	
	Возврат ОбщегоНазначенияПереопределяемый.СформироватьСтрокуJSON(ДанныеВК);
	
КонецФункции

// Функция - Сформировать данные объекта для подписи
//
// Параметры:
//  Ссылка  - Ссылка - Ссылка на подписываемый объект 
//  Версия  - Число - Номер версии формируемого хеша. Если не указан - считается, что формируется самая актуальная версия
// 
// Возвращаемое значение:
// Строка - Представление важных данных объекта в строковом виде
//
Функция СформироватьДанныеОбъектаДляПодписи(Ссылка, Версия = Неопределено, ПараметрыПриема = Неопределено) Экспорт
	
	ТипОбъекта = ТипЗнч(Ссылка);
	
	Если Версия = Неопределено Тогда
		Версия = ПолучитьАктуальныйНомерВерсииПодписываемыхДанных(ТипОбъекта);
	КонецЕсли;
	
	ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка);
	
	Если ИмяТипаДокумента = "Документ.Прием" Тогда
		Возврат СформироватьДанныеПриема(Ссылка, Версия, ПараметрыПриема);
	ИначеЕсли ИмяТипаДокумента = "Документ.ПрохождениеМедосмотра" Тогда
		Возврат СформироватьДанныеПрохожденияМедОсмотра(Ссылка);
	ИначеЕсли ИмяТипаДокумента = "Документ.МедицинскийОтчет" Тогда
		Возврат СформироватьДанныеМедицинскийОтчет(Ссылка);
	ИначеЕсли ИмяТипаДокумента = "Документ.ВрачебнаяКомиссия" Тогда // Версия КОРП
		Возврат СформироватьДанныеВрачебнойКомиссии(Ссылка);
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#Область СтарыеФункцииФормированияДанныхПриема

Функция СформироватьХешПриемаВерсия2(Ссылка) Экспорт
	
	ХешируемаяСтрока = "";
	Прием = Ссылка.ПолучитьОбъект();
	ХешДанных = ОбщегоНазначенияСервер.СоздатьХешированиеДанных();
	
	ХешируемаяСтрока = 
		Строка(Прием.Ссылка.УникальныйИдентификатор()) +
		Формат(Прием.Дата, "ДФ=dd.MM.yy") +
		Строка(Прием.Клиент.УникальныйИдентификатор()) +
		Строка(Прием.Врач.УникальныйИдентификатор()) +
		Строка(Прием.МедицинскаяКарта.УникальныйИдентификатор()) +
		Строка(Прием.ШаблонОсмотра.УникальныйИдентификатор()) +
		Строка(Прием.Филиал.УникальныйИдентификатор()) +
		Строка(Прием.УдалитьТипЭМПЗ.УникальныйИдентификатор()) +
		Строка(Прием.ПометкаУдаления) +
		Строка(Прием.НуждаетсяВПроведенииДопОбследования) +
		Строка(Прием.НуждаетсяВОбследованииВЦентреПрофпатологии) +
		Строка(Прием.НуждаетсяВАмбулаторномОбследованииИЛечении) +
		Строка(Прием.НуждаетсяВСтационарномОбследованииИЛечении) +
		Строка(Прием.НуждаетсяВСанаторноКурортномЛечении) +
		Строка(Прием.НуждаетсяВДиспансерномНаблюдении);
	
	// Диагнозы
	Для Каждого СтрокаДиагноз Из Прием.Диагнозы Цикл
		
		ХешируемаяСтрока = ХешируемаяСтрока +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Диагноз) +
			СтрокаДиагноз.Детализация +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.ВыявленВпервые) +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Классификация1) +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Классификация2) +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Классификация3) +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Сопутствующий) +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Травма) +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Исход);
		
		Если Прием.Диагнозы.ВыгрузитьКолонки().Колонки.Найти("Противопоказание") <> Неопределено Тогда
			ХешируемаяСтрока = ХешируемаяСтрока + ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Противопоказание);
		КонецЕсли;
		Если Прием.Диагнозы.ВыгрузитьКолонки().Колонки.Найти("Профессиональное") <> Неопределено Тогда
			ХешируемаяСтрока = ХешируемаяСтрока + ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.Профессиональное);
		КонецЕсли;
		Если Прием.Диагнозы.ВыгрузитьКолонки().Колонки.Найти("ПрофнепригодностьВременная") <> Неопределено Тогда
			ХешируемаяСтрока = ХешируемаяСтрока + ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаДиагноз.ПрофнепригодностьВременная);
		КонецЕсли;
	КонецЦикла;
	
	// Вредные факторы
	Для Каждого СтрокаФактор Из Прием.ВредныеФакторыПротивопоказаний Цикл
		
		ХешируемаяСтрока = ХешируемаяСтрока +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(СтрокаФактор.ВредныйФактор);
		
	КонецЦикла;
	
	// Значения параметров html
	Выборка = РегистрыСведений.ЗначенияПараметровHTML.Выбрать(Новый Структура("Документ", Ссылка));
	Пока Выборка.Следующий() Цикл
		
		ХешируемаяСтрока = ХешируемаяСтрока +
			Строка(Выборка.Параметр.УникальныйИдентификатор()) +
			ПолучитьСтроковоеПредставлениеЗначенияВерсия2(Выборка.Значение);
		
	КонецЦикла;
	// Хешируем строку приема
	ХешДанных.Добавить(ХешируемаяСтрока);
	
	// Файлы приема
	БазовыйКаталог = РаботаСФайлами.ПолучитьБазовыйКаталогФайлов(Ссылка);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ХранилищеДополнительнойИнформации.Ссылка,
		|	ХранилищеДополнительнойИнформации.ВФайле,
		|	ХранилищеДополнительнойИнформации.Наименование,
		|	ХранилищеДополнительнойИнформации.Хранилище
		|ИЗ
		|	Справочник.ХранилищеДополнительнойИнформации КАК ХранилищеДополнительнойИнформации
		|ГДЕ
		|	ХранилищеДополнительнойИнформации.Объект = &Объект
		|	И НЕ ХранилищеДополнительнойИнформации.ПометкаУдаления";
	Запрос.УстановитьПараметр("Объект", Ссылка);
	ВыборкаФайлы = Запрос.Выполнить().Выбрать();
	Пока ВыборкаФайлы.Следующий() Цикл
		Если ВыборкаФайлы.ВФайле Тогда
			ФайлПриема = Новый Файл(БазовыйКаталог + ВыборкаФайлы.Наименование);
			Если ФайлПриема.Существует() Тогда
				ХешДанных.ДобавитьФайл(ФайлПриема.ПолноеИмя);
			Иначе
				ХешДанных.Добавить("Файл отсутствует");
			КонецЕсли;
		Иначе
			ХешДанных.Добавить(ВыборкаФайлы.Хранилище.Получить());
		КонецЕсли;
	КонецЦикла;
	
	Возврат ХешДанных.ХешСумма;
	
КонецФункции

Функция ПолучитьСтроковоеПредставлениеЗначенияВерсия2(Значение)
	
	Попытка
		Возврат Строка(Значение.УникальныйИдентификатор());
	Исключение
		Попытка
			Возврат ЗначениеВСтрокуВнутр(Значение);
		Исключение
			Возврат "Error";
		КонецПопытки;
	КонецПопытки;
	
КонецФункции

#КонецОбласти

#Область ПроверкаПодписейОбъекта

Функция СоздатьТаблицуПодписей()
	
	ТаблицаПодписей = Новый ТаблицаЗначений;
	ТаблицаПодписей.Колонки.Добавить("КомуВыданСертификат",			Новый ОписаниеТипов("Строка"));
	ТаблицаПодписей.Колонки.Добавить("ДатаПодписи",					Новый ОписаниеТипов("Дата"));
	ТаблицаПодписей.Колонки.Добавить("Комментарий",					Новый ОписаниеТипов("Строка"));
	ТаблицаПодписей.Колонки.Добавить("Статус",						Новый ОписаниеТипов("Строка"));
	ТаблицаПодписей.Колонки.Добавить("Объект");
	ТаблицаПодписей.Колонки.Добавить("АдресПодписи",				Новый ОписаниеТипов("Строка"));
	ТаблицаПодписей.Колонки.Добавить("Отпечаток",					Новый ОписаниеТипов("Строка"));
	ТаблицаПодписей.Колонки.Добавить("Неверна",						Новый ОписаниеТипов("Булево"));
	ТаблицаПодписей.Колонки.Добавить("ИндексКартинки",				Новый ОписаниеТипов("Число"));
	ТаблицаПодписей.Колонки.Добавить("УстановившийПодпись",			Новый ОписаниеТипов("СправочникСсылка.Пользователи"));
	ТаблицаПодписей.Колонки.Добавить("НомерСтроки",					Новый ОписаниеТипов("Число"));
	ТаблицаПодписей.Колонки.Добавить("АдресСертификата",			Новый ОписаниеТипов("Строка"));
	ТаблицаПодписей.Колонки.Добавить("Зашифрован",					Новый ОписаниеТипов("Булево"));
	ТаблицаПодписей.Колонки.Добавить("ТекстОшибкиПроверкиПодписи",	Новый ОписаниеТипов("Строка"));
	ТаблицаПодписей.Колонки.Добавить("Версия",						Новый ОписаниеТипов("Число"));
	ТаблицаПодписей.Колонки.Добавить("Субъект",						Новый ОписаниеТипов("Строка"));
	
	Возврат ТаблицаПодписей;
	
КонецФункции

Функция ПолучитьМассивДанныхПодписейОбъекта(Ссылка) Экспорт
	
	ТаблицаПодписей = СоздатьТаблицуПодписей();
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписейДокумента(Ссылка, ТаблицаПодписей, 0, Новый УникальныйИдентификатор);
	Возврат ОбщегоНазначения.ТаблицаЗначенийВМассив(ТаблицаПодписей);
	
КонецФункции

Процедура ПроверитьВсеПодписиОбъекта(Ссылка) Экспорт
	
	ТаблицаПодписей = СоздатьТаблицуПодписей();
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписейДокумента(Ссылка, ТаблицаПодписей, 0, Новый УникальныйИдентификатор);
	// доп_СертификатыЭЦП.ПроверитьВсеНаСервере(ТаблицаПодписей);
	УстановитьСтатусПроверкиЭЦПОбъекта(Ссылка);
	
КонецПроцедуры

Процедура УстановитьСтатусПроверкиЭЦПОбъекта(Ссылка) Экспорт
	
	ТаблицаПодписей = СоздатьТаблицуПодписей();
	доп_СертификатыЭЦП.ЗаполнитьСписокПодписейДокумента(Ссылка, ТаблицаПодписей, 0, Новый УникальныйИдентификатор);
	
	ОбщаяПодписьВерна = Ложь;
	Для Каждого ОднаПодпись Из ТаблицаПодписей Цикл
		Если Не ОднаПодпись.Неверна Тогда
			ОбщаяПодписьВерна = Истина;
			Если ОбщаяПодписьВерна = Неопределено Тогда
				ОбщаяПодписьВерна = Истина;
			Иначе
				ОбщаяПодписьВерна = ОбщаяПодписьВерна И Не ОднаПодпись.Неверна;
			КонецЕсли;
			доп_СертификатыЭЦП.УстановитьСтатусПроверки(Ссылка, ПредопределенноеЗначение("Перечисление.СтатусПроверкиЭП.ПодписьДействительна"));
		КонецЕсли;
	КонецЦикла;
	
	Если ОбщаяПодписьВерна = Ложь Тогда
		доп_СертификатыЭЦП.УстановитьСтатусПроверки(Ссылка, ПредопределенноеЗначение("Перечисление.СтатусПроверкиЭП.ПодписьНедействительна"));
	КонецЕсли;
	Если ТаблицаПодписей.Количество() = 0 Тогда
		доп_СертификатыЭЦП.УстановитьСтатусПроверки(Ссылка, ПредопределенноеЗначение("Перечисление.СтатусПроверкиЭП.ПодписиНет"));
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкаПолейСубъектаЭЦП

Функция ПолучитьНастройкуПолейСубъектаЭЦП(Дата = Неопределено) Экспорт
	
	Возврат УправлениеНастройками.ПолучитьПараметрУчетнойПолитики("НастройкаПолейСубъектаЭЦП", Дата).Получить();
	
КонецФункции

Функция ПолучитьПредставлениеПолейСубъектаЭЦП(Знач Субъект, НастройкаПолей = Неопределено) Экспорт
	
	Если НастройкаПолей = Неопределено Тогда
		НастройкаПолей = ПолучитьНастройкуПолейСубъектаЭЦП();
	КонецЕсли;
	
	Представление = "";
	Для Каждого ПолеСубъекта Из НастройкаПолей Цикл
		ЗначениеПоля = "";
		МетданныеСубъекта = ПолеСубъекта.Метаданные();
		ИмяМетаданных = МетданныеСубъекта.Имя;
		Если Субъект.Свойство(МетданныеСубъекта.ЗначенияПеречисления[Перечисления[ИмяМетаданных].Индекс(ПолеСубъекта)].Имя, ЗначениеПоля) Тогда
			Представление = Представление + ", " + ЗначениеПоля;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Прав(Представление, СтрДлина(Представление) - 2);
	
КонецФункции

#КонецОбласти

#Область ПодпискиНаСобытия

Процедура ДокументПроверкаИзмененияПодписанныхЭЦППередЗаписью(Источник, Отказ, РежимЗаписи, РежимПроведения) Экспорт
	
	Если Не ОбъектПодписываетсяЭЦП(Источник.Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Источник.ЭтоНовый()
		И Источник.ПометкаУдаления
		И Источник.ПометкаУдаления <> Источник.Ссылка.ПометкаУдаления
		И Источник.ПодписанЭП
		И Не КорректноеУдалениеМедицинскогоДокумента(Источник)
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нельзя изменять признак пометки удаления подписанного объекта'"));
		Отказ = Истина;
	КонецЕсли;
	
	Если Не Отказ
		И Не Источник.ЭтоНовый()
		И ИспользоватьЭлектронныеПодписиЭМК()
		И Источник.ПодписанЭП
		И Не (Источник.ДополнительныеСвойства.Свойство("ПроверкаКлючевыхПолейОтключена")
			И Источник.ДополнительныеСвойства.ПроверкаКлючевыхПолейОтключена)
		И ИзмененыКлючевыеПоляПодписанногоДокумента(Источник)
	Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(НСтр("ru='Нельзя изменять ключевые поля подписанного объекта'"));
		Отказ = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

Функция СформироватьPDFИзТабДока(Ссылка, ИмяМакета, ИмяВременногоКаталога = Неопределено, СохранениеЭМД = Истина, ИмяДокумента = "", ЗаписьВПоток = Ложь, ТабДок = Неопределено, ПриказВредныйФактор = Неопределено) Экспорт
	
	Если ТабДок = Неопределено Тогда
		Если ТипЗнч(ИмяМакета) = Тип("Строка") Тогда
			МодульМенеджераДокумента = ОбщегоНазначения.МенеджерОбъектаПоСсылке(Ссылка);
			Если ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка) = "Документ.ПрохождениеМедосмотра" Тогда
				ТабДок = МодульМенеджераДокумента.Печать(Ссылка, ИмяМакета, СохранениеЭМД, ПриказВредныйФактор);
			Иначе
				ТабДок = МодульМенеджераДокумента.Печать(Ссылка, ИмяМакета, СохранениеЭМД);
			КонецЕсли;
		Иначе
			// В частности, для печати дополнительных приказов медосмотров
			стрРасшифровка = Новый Структура;
			стрРасшифровка.Вставить("ВидПечатнойФормы", Перечисления.ВидыДополнительныхВнешнихОбработок.ПечатнаяФорма);
			стрРасшифровка.Вставить("СсылкаНаВнешнююОбработку", ИмяМакета);
			стрРасшифровка.Вставить("ЗаменяемаяПечатнаяФорма", Справочники.ВнешниеОбработки.ПустаяСсылка());
			ТабДок = УниверсальныеМеханизмыСервер.НапечататьВнешнююФорму(Ссылка, стрРасшифровка);
		КонецЕсли;
	КонецЕсли;
	
	СистемнаяИнформация = Новый СистемнаяИнформация;
	Если ОбщегоНазначенияКлиентСервер.СравнитьВерсии(СистемнаяИнформация.ВерсияПриложения, "8.3.15.0") > 0 Тогда
		ТипФайлаЭМД = "PDF_A_1";
	Иначе
		ТипФайлаЭМД = "PDF";
	КонецЕсли;
	
	Если ЗаписьВПоток Тогда
		ДанныеТабдока = Новый ПотокВПамяти;
	Иначе
		ДанныеТабдока = ИмяВременногоКаталога + ?(ЗначениеЗаполнено(ИмяДокумента), Строка(ИмяДокумента), Строка(Ссылка.УникальныйИдентификатор())) + ".pdf";
	КонецЕсли;
	
	ТабДок.Записать(ДанныеТабдока, ТипФайлаТабличногоДокумента[ТипФайлаЭМД]);
	
	Возврат ДанныеТабдока;
	
КонецФункции

Функция ТекущийПользовательЯвляетсяВрачомДокумента(ВрачДокумента) Экспорт
	
	СотрудникиПользователя = ОтраслевыеДополнения.СотрудникиПользователя(ПараметрыСеанса.ТекущийПользователь);
	Возврат СотрудникиПользователя.Найти(ВрачДокумента) <> Неопределено;
	
КонецФункции

// Получить сертификаты МО пользователя
//
// Параметры:
//  Филиал	 - СправочникСсылка.Филиалы, СправочникСсылка.Организации - МО сертификата
// 
// Возвращаемое значение:
//  Массив - Сертификаты МО пользователя
//
Функция ПолучитьСертификатыМОПользователя(Филиал, Полномочия = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПодписиМО.Сертификат КАК СертификатМО
		|ИЗ
		|	РегистрСведений.ПодписиМО КАК ПодписиМО
		|ГДЕ
		|	ПодписиМО.Филиал <> НЕОПРЕДЕЛЕНО
		|	И (ПодписиМО.Филиал ССЫЛКА Справочник.Филиалы
		|				И ПодписиМО.Филиал = &Филиал
		|			ИЛИ (ПодписиМО.Филиал ССЫЛКА Справочник.Организации
		|					И ПодписиМО.Филиал В (&ОрганизацииФилиала)
		|				ИЛИ ПодписиМО.Филиал ССЫЛКА Справочник.Филиалы
		|					И ПодписиМО.Филиал.Организация В (&ОрганизацииФилиала)))
		|	И НЕ ПодписиМО.Сертификат.ПометкаУдаления
		|	И (&ОтборПоСертификатуПользователя
		|			ИЛИ ПодписиМО.Сертификат В (&СертификатыПользователя))
		|
		|ОБЪЕДИНИТЬ
		|
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка
		|ИЗ
		|	Справочник.МашиночитаемыеДоверенности КАК МашиночитаемыеДоверенности
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.МашиночитаемыеДоверенности.Полномочия КАК ПолномочияМЧД
		|		ПО (ПолномочияМЧД.Ссылка = МашиночитаемыеДоверенности.Ссылка)
		|			И (&Полномочия = НЕОПРЕДЕЛЕНО
		|				ИЛИ ПолномочияМЧД.Полномочие = &Полномочия)
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
		|		ПО МашиночитаемыеДоверенности.Пользователь = СертификатыКлючейЭлектроннойПодписиИШифрования.Пользователь
		|			И (МашиночитаемыеДоверенности.Организация В (&ОрганизацииФилиала))
		|			И (МашиночитаемыеДоверенности.Пользователь = &Пользователь)
		|			И (НЕ МашиночитаемыеДоверенности.ПометкаУдаления)";
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	Если Полномочия = Перечисления.ПолномочияЭЦП.ФСС
		И УправлениеНастройкамиМедицинскогоУчета.ПолучитьПараметрУчетнойПолитики("СертификатыМОДоступныВсемПользователям")
	Тогда
		Запрос.УстановитьПараметр("ОтборПоСертификатуПользователя", Ложь);
		Запрос.УстановитьПараметр("СертификатыПользователя", Неопределено);
	Иначе
		Запрос.УстановитьПараметр("ОтборПоСертификатуПользователя", Истина);
		Запрос.УстановитьПараметр("СертификатыПользователя", ПолучитьСертификатыПользователя(ТекущийПользователь));
	КонецЕсли;
	
	Запрос.УстановитьПараметр("Полномочия", Полномочия);
	Запрос.УстановитьПараметр("Пользователь", ТекущийПользователь);
	
	Если ТипЗнч(Филиал) = Тип("СправочникСсылка.Организации") Тогда
		Запрос.УстановитьПараметр("Филиал", Неопределено);
		Запрос.УстановитьПараметр("ОрганизацииФилиала", ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Филиал));
	ИначеЕсли ТипЗнч(Филиал) = Тип("Строка")
		Или ТипЗнч(Филиал) = Тип("Число")
	Тогда
		Запрос.УстановитьПараметр("Филиал", Неопределено);
		Запрос.УстановитьПараметр("ОрганизацииФилиала", ОрганизацииПоОГРН(Формат(Филиал, "ЧГ=0")));
	Иначе
		Запрос.УстановитьПараметр("Филиал", Филиал);
		Запрос.УстановитьПараметр("ОрганизацииФилиала", ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(Филиал.Организация));
	КонецЕсли;
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СертификатМО");
	
КонецФункции

Функция ПолучитьСертификатыПользователя(Пользователь = Неопределено) Экспорт
	
	Если Пользователь = Неопределено Тогда
		ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	Иначе
		ТекущийПользователь = Пользователь;
	КонецЕсли;
	
	ФизическиеЛицаИспользуются = Константы.ФизическиеЛицаИспользуются.Значение() И ЗначениеЗаполнено(ТекущийПользователь.ФизическоеЛицо);
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СертификатыКлючейЭлектроннойПодписиИШифрования.Ссылка КАК Сертификат
		|ИЗ
		|	Справочник.СертификатыКлючейЭлектроннойПодписиИШифрования КАК СертификатыКлючейЭлектроннойПодписиИШифрования
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
		|		ПО СертификатыКлючейЭлектроннойПодписиИШифрования.Пользователь = Пользователи.Ссылка
		|			И (НЕ Пользователи.ПометкаУдаления)
		|			И (НЕ &ФизическиеЛицаИспользуются
		|					И Пользователи.Ссылка = &ТекущийПользователь
		|				ИЛИ &ФизическиеЛицаИспользуются
		|					И Пользователи.ФизическоеЛицо = &ФизическоеЛицо)";
	
	Запрос.УстановитьПараметр("ФизическиеЛицаИспользуются",	ФизическиеЛицаИспользуются);
	Запрос.УстановитьПараметр("ТекущийПользователь",		ТекущийПользователь);
	Запрос.УстановитьПараметр("ФизическоеЛицо",				ТекущийПользователь.ФизическоеЛицо);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Сертификат");
	
КонецФункции

Процедура ВывестиБлокиЭЦП(СсылкаНаОбъект, Макет, ТабДокумент, ПорядокРолейПодписей, ОбластьЭЦП) Экспорт
	
	Если СсылкаНаОбъект.ПодписанЭП Тогда
		
		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РолиИПодписиЭМД.РольПодписи КАК РольПодписи,
			|	ЭлектронныеПодписи.Сертификат КАК Сертификат,
			|	ЭлектронныеПодписи.ДатаПодписи КАК ДатаПодписи
			|ИЗ
			|	РегистрСведений.ЭлектронныеПодписи КАК ЭлектронныеПодписи
			|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.РолиИПодписиЭМД КАК РолиИПодписиЭМД
			|		ПО (РолиИПодписиЭМД.Документ = &Документ)
			|			И (РолиИПодписиЭМД.УИД_ЭЦП = ЭлектронныеПодписи.УникальныйИдентификатор)
			|			И (РолиИПодписиЭМД.Пользователь = ЗНАЧЕНИЕ(Справочник.Пользователи.ПустаяСсылка)
			|				ИЛИ РолиИПодписиЭМД.Пользователь = ЭлектронныеПодписи.УстановившийПодпись)";
		
		Запрос.УстановитьПараметр("Документ", СсылкаНаОбъект);
		Выборка = Запрос.Выполнить().Выбрать();
		
		ДанныеПодписейПоРолям = Новый Соответствие;
		
		Пока Выборка.Следующий() Цикл
			Если ПорядокРолейПодписей.Найти(Выборка.РольПодписи) <> Неопределено Тогда
				ДанныеПодписейПоРолям.Вставить(Выборка.РольПодписи, ПолучитьДанныеСертификата(Выборка.Сертификат, СсылкаНаОбъект, Выборка.ДатаПодписи));
			КонецЕсли;
		КонецЦикла;
		
		Для Каждого Роль Из ПорядокРолейПодписей Цикл
			ДанныеПодписи = ДанныеПодписейПоРолям.Получить(Роль);
			Если ДанныеПодписи <> Неопределено Тогда
				ЗаполнитьЗначенияСвойств(ОбластьЭЦП.Параметры, ДанныеПодписи);
				ТабДокумент.Вывести(ОбластьЭЦП);
			КонецЕсли;
		КонецЦикла;
		
	Иначе
		ОбластьЭЦП = Макет.ПолучитьОбласть("ОбластьЭЦПОтсутствует");
		ТабДокумент.Вывести(ОбластьЭЦП);
	КонецЕсли;
	
КонецПроцедуры

Функция ПолучитьДанныеСертификата(ДанныеСертификата, Ссылка, ДатаПодписи, HTML = Ложь) Экспорт
	
	ДанныеПодписи = Новый Структура("Сертификат, ВладелецСертификата, ДействительностьСертификатаНачало, ДействительностьСертификатаОкончание, ДатаПодписи, НаименованиеОрганизации");
	
	Если ТипЗнч(ДанныеСертификата) = Тип("Строка") Тогда
		Сертификат = Новый СертификатКриптографии(ПолучитьИзВременногоХранилища(ДанныеСертификата));
	Иначе
		Сертификат = Новый СертификатКриптографии(ДанныеСертификата.Получить());
	КонецЕсли;
	
	Если Сертификат.Субъект.Свойство("O") Тогда
		ДанныеЮрЛица = Новый Массив;
		ДанныеЮрЛица.Добавить(?(Сертификат.Субъект.Свойство("OID2_5_4_10"), Сертификат.Субъект.OID2_5_4_10, ""));			// Организация
		ДанныеЮрЛица.Добавить(?(Сертификат.Субъект.Свойство("OID2_5_4_7"), Сертификат.Субъект.OID2_5_4_7, ""));				// Населенный пункт
		ДанныеЮрЛица.Добавить(?(Сертификат.Субъект.Свойство("OID2_5_4_9"), Сертификат.Субъект.OID2_5_4_9, ""));				// Улица и дом
		ДанныеЮрЛица.Добавить(?(Сертификат.Субъект.Свойство("OID1_2_643_100_1"), Сертификат.Субъект.OID1_2_643_100_1, ""));	// ОГРН
		ДанныеПодписи.ВладелецСертификата = СтрСоединить(ДанныеЮрЛица, ", ") + "";
		ДанныеПодписи.НаименованиеОрганизации = ?(Сертификат.Субъект.Свойство("OID2_5_4_10"), Сертификат.Субъект.OID2_5_4_10, "");
	Иначе
		ФИОВладельца = Новый Массив;
		ФИОВладельца.Добавить(Сертификат.Субъект.SN);	// Фамилия физического лица
		ФИОВладельца.Добавить(Сертификат.Субъект.GN);	// Имя и отчество физического лица
		ДанныеПодписи.ВладелецСертификата = СтрСоединить(ФИОВладельца, " ");
		ДанныеПодписи.НаименованиеОрганизации = ПроцедурыСпециализацииПоставки.ПолучитьРеквизитыОрганизации(Ссылка).НазваниеОрганизации;
	КонецЕсли;
	
	ДанныеПодписи.Сертификат = Сертификат.СерийныйНомер;
	ДанныеПодписи.ДействительностьСертификатаНачало = Формат(Сертификат.ДатаНачала, "ДФ=dd.MM.yyyy");
	ДанныеПодписи.ДействительностьСертификатаОкончание = Формат(Сертификат.ДатаОкончания, "ДФ=dd.MM.yyyy");
	ДанныеПодписи.ДатаПодписи = Формат(ДатаПодписи, "ДФ=dd.MM.yyyy");
	
	Возврат ДанныеПодписи;
	
КонецФункции

Функция СохранитьИзмененияВДокументе(Документ, СтруктурыЭЦППоУИДЭЦП) Экспорт
	
	РезультатСохранения = Новый Структура;
	РезультатСохранения.Вставить("ЗаписьУспешна",	Ложь);
	РезультатСохранения.Вставить("УИДы",			Новый Массив);
	
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат РезультатСохранения;
	КонецЕсли;
	
	ДокументОбъект = Документ.ПолучитьОбъект();
	
	Для Каждого СтруктураЭЦППоСтрокеЭЦП Из СтруктурыЭЦППоУИДЭЦП Цикл
		// Фиксируем в документе полученную информацию
		СтруктураПараметровЭЦП = СтруктураЭЦППоСтрокеЭЦП.СтруктураДанных;
		
		СтрРИП = ДокументОбъект.РолиИПодписиЭМД.Добавить();
		СтрРИП.УИД_ЭМД					= СтруктураПараметровЭЦП.УИД;
		СтрРИП.УИД_ЭЦП					= СтруктураЭЦППоСтрокеЭЦП.УИД_ЭЦП;
		СтрРИП.РольСотрудника			= СтруктураПараметровЭЦП.Роль;
		СтрРИП.ДолжностьМинздрава		= СтруктураПараметровЭЦП.ДолжностьМЗ;
		
		СтрРезультат = Новый Структура("УИД_ЭМД, УИД_ЭЦП, РольСотрудника, ДолжностьМинздрава, СпециальностьМинздрава");
		ЗаполнитьЗначенияСвойств(СтрРезультат, СтрРИП);
		СтрРезультат.СпециальностьМинздрава = СтруктураПараметровЭЦП.СпециальностьМинздрава;
		РезультатСохранения.УИДы.Добавить(СтрРезультат);
	КонецЦикла;
	
	// Сохраним изменения в документе и вернем результат
	Попытка
		ДокументОбъект.Записать();
		РезультатСохранения.ЗаписьУспешна = Истина;
	Исключение
		Сообщить(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		РезультатСохранения.ЗаписьУспешна = Ложь;
	КонецПопытки;
	
	Возврат РезультатСохранения;
	
КонецФункции

Функция СохранитьИзмененияВРолиИПодписиЭМД(Документ, СтрокиЭЦПНеРЭМД) Экспорт
	
	РезультатСохранения = Новый Структура("ЗаписьУспешна, УИДы", Ложь, Новый Массив);
	Если Не ЗначениеЗаполнено(Документ) Тогда
		Возврат РезультатСохранения;
	КонецЕсли;
	
	Для Каждого СтрокаЭЦП Из СтрокиЭЦПНеРЭМД Цикл
		// Фиксируем в документе полученную информацию
		СтрРИП = РегистрыСведений.РолиИПодписиЭМД.СоздатьМенеджерЗаписи();
		
		ЗаполнитьЗначенияСвойств(СтрРИП, СтрокаЭЦП);
		СтрРИП.УИД_ЭЦП = СтрокаЭЦП.ПолученныйУИДЭЦП;
		СтрРИП.Документ = Документ;
		
		СтрРИП.Записать();
		
		РезультатСохранения.ЗаписьУспешна = Истина;
		РезультатСохранения.УИДы.Добавить(Новый Структура("Роль, УИД_ЭМД, УИД_ЭЦП", СтрРИП.РольПодписи, СтрРИП.УИД_ЭМД, СтрРИП.УИД_ЭЦП));
	КонецЦикла;
	
	Возврат РезультатСохранения;
	
КонецФункции

Функция ИзмененыКлючевыеПоляПодписанногоДокумента(Источник)
	
	ИмяРеквизитаКлиента = Неопределено;
	КлючевыеРеквизиты = ПолучитьКлючевыеРеквизиты(Источник.Ссылка, ИмяРеквизитаКлиента);
	
	Для Каждого ИмяРеквизита Из КлючевыеРеквизиты.Реквизиты Цикл
		// У реквизитов составного типа может быть "Неопределено", поэтому проверяются только заполненные, считаем, что пустые ссылки разных типов и "Неопределено" равнозначны при проверке
		Если ЗначениеЗаполнено(Источник[ИмяРеквизита])
			И ЗначениеЗаполнено(Источник.Ссылка[ИмяРеквизита])
			И Источник[ИмяРеквизита] <> Источник.Ссылка[ИмяРеквизита]
		Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого СтруктураТЧ Из КлючевыеРеквизиты.ТабличныеЧасти Цикл
		Если Источник[СтруктураТЧ.Имя].Количество() <> Источник.Ссылка[СтруктураТЧ.Имя].Количество() Тогда
			Возврат Истина;
		КонецЕсли;
		
		Для Индекс = 0 По Источник[СтруктураТЧ.Имя].Количество() - 1 Цикл
			Для Каждого ИмяРеквизита Из СтруктураТЧ.Реквизиты Цикл
				Если ЗначениеЗаполнено(Источник[СтруктураТЧ.Имя][Индекс][ИмяРеквизита])
					И ЗначениеЗаполнено(Источник.Ссылка[СтруктураТЧ.Имя][Индекс][ИмяРеквизита])
					И Источник[СтруктураТЧ.Имя][Индекс][ИмяРеквизита] <> Источник.Ссылка[СтруктураТЧ.Имя][Индекс][ИмяРеквизита]
				Тогда
					Возврат Истина;
				КонецЕсли;
			КонецЦикла;
		КонецЦикла;
	КонецЦикла;
	
	Если ЗначениеЗаполнено(ИмяРеквизитаКлиента) Тогда
		ИмяРеквизитаСНИЛС = Метаданные.Справочники.Клиенты.Реквизиты.СНИЛС.Имя;
		Если Источник[ИмяРеквизитаКлиента][ИмяРеквизитаСНИЛС] <> Источник.Ссылка[ИмяРеквизитаКлиента][ИмяРеквизитаСНИЛС] Тогда
			Возврат Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции

Функция ПолучитьКлючевыеРеквизиты(Ссылка, ИмяРеквизитаКлиента)
	
	КлючевыеРеквизиты = ЭЦП_СерверПереопределяемый.КлючевыеПоляПодписанногоДокумента(Ссылка, ИмяРеквизитаКлиента);
	
	Если КлючевыеРеквизиты = Неопределено Тогда
		КлючевыеРеквизиты = Новый Структура("Реквизиты, ТабличныеЧасти", Новый Массив, Новый Массив);
		
		ИмяТипаДокумента = ДопСерверныеФункции.ИмяСсылочногоТипа(Ссылка);
		Если ИмяТипаДокумента = "Документ.Прием" Тогда
			МетаданныеДокумента = Метаданные.Документы.Прием;
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Врач.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Филиал.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ШаблонОсмотра.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.МедицинскаяКарта.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Тестовый.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.СтандартныеРеквизиты.Дата.Имя);
			
			МетаданныеДиагнозов = МетаданныеДокумента.ТабличныеЧасти.Диагнозы;
			Диагнозы = Новый Структура("Имя, Реквизиты", МетаданныеДиагнозов.Имя, Новый Массив);
			Для Каждого РеквизитДиагноза Из МетаданныеДиагнозов.Реквизиты Цикл
				Диагнозы.Реквизиты.Добавить(РеквизитДиагноза.Имя);
			КонецЦикла;
			КлючевыеРеквизиты.ТабличныеЧасти.Добавить(Диагнозы);
			
			МетаданныеШаблонов = МетаданныеДокумента.ТабличныеЧасти.ШаблоныПриема;
			КлючевыеРеквизиты.ТабличныеЧасти.Добавить(Новый Структура("Имя, Реквизиты", МетаданныеШаблонов.Имя, ОбщегоНазначенияБИТКлиентСервер.НовыйМассив(МетаданныеШаблонов.Реквизиты.ШаблонПриема.Имя)));
			
			ИмяРеквизитаКлиента = МетаданныеДокумента.Реквизиты.Клиент.Имя;
			
		ИначеЕсли ИмяТипаДокумента = "Документ.Рецепт" Тогда
			
			МетаданныеДокумента = Метаданные.Документы.Рецепт;
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Врач.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Филиал.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВремяПриемаОтносительноЕды1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВремяПриемаОтносительноЕды2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВремяПриемаОтносительноЕды3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВремяПриемаОтносительноСна1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВремяПриемаОтносительноСна2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ВремяПриемаОтносительноСна3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Диагноз.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Дозировка1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Дозировка2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Дозировка3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Дополнение1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Дополнение2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Дополнение3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ЕдИзмПоКлассификатору1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ЕдИзмПоКлассификатору2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ЕдИзмПоКлассификатору3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ЕдиницаИзмерения1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ЕдиницаИзмерения2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ЕдиницаИзмерения3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Количество1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Количество2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Количество3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ЛьготнаяКатегория.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.МедицинскаяКарта.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Номенклатура1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Номенклатура2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Номенклатура3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ПериодичностьОтпуска.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ПоСпециальномуНазначению.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Полис.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ПутьВведенияПрепарата1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ПутьВведенияПрепарата2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ПутьВведенияПрепарата3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.РазВДень1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.РазВДень2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.РазВДень3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Серия.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.СколькоДней1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.СколькоДней2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.СколькоДней3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.СпособПрименения1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.СпособПрименения2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.СпособПрименения3.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Срок.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Срочность.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.Тестовый.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ТипЛьготы.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ФормаРецепта.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ХарактеристикаНоменклатуры1.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ХарактеристикаНоменклатуры2.Имя);
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.Реквизиты.ХарактеристикаНоменклатуры3.Имя);
			
			КлючевыеРеквизиты.Реквизиты.Добавить(МетаданныеДокумента.СтандартныеРеквизиты.Дата.Имя);
			
			ИмяРеквизитаКлиента = МетаданныеДокумента.Реквизиты.Клиент.Имя;
			
		КонецЕсли;
	КонецЕсли;
	
	Возврат КлючевыеРеквизиты;
	
КонецФункции

Функция ОрганизацииПоОГРН(ОГРН)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Организации.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.Организации КАК Организации
		|ГДЕ
		|	Организации.ОГРН = &ОГРН";
	
	Запрос.УстановитьПараметр("ОГРН", ОГРН);
	
	Возврат Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Ссылка");
	
КонецФункции

Функция КорректноеУдалениеМедицинскогоДокумента(Источник)
	
	Если ДопСерверныеФункции.ИмяСсылочногоТипа(Источник.Ссылка) <> "Документ.МедицинскийДокумент" Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Для Каждого СтрокаЭМД Из Источник.ЭМД Цикл
		Если ЗначениеЗаполнено(СтрокаЭМД.СообщениеРЭМД)
			И Не СтрокаЭМД.СообщениеРЭМД.ПометкаУдаления
		Тогда
			Возврат Ложь;
		КонецЕсли;
	КонецЦикла;
	
	Возврат Истина;
	
КонецФункции

#Область КартинкаЭЦП

Функция ИмяРисункаЭЦПВТабличномДокументе() Экспорт
	
	Возврат "доп_ЭЦП";
	
КонецФункции

Процедура ДобавитьРисунокЭЦПВТабличныйДокумент(ТабличныйДокумент, ПараметрыЭЦПТабличногоШаблона, ДанныеПодписи, РасположениеПодписи, ВысотаТаблицы) Экспорт
	
	ДанныеКартинки = СформироватьДанныеКартинкиСертификатаSVG(ДанныеПодписи);
	ПараметрыРисунка = СформироватьПараметрыРисунка(ТабличныйДокумент, ПараметрыЭЦПТабличногоШаблона, ДанныеКартинки, РасположениеПодписи, ВысотаТаблицы);
	
	Рисунок = ТабличныйДокумент.Рисунки.Добавить(ТипРисункаТабличногоДокумента.Картинка);
	Рисунок.Имя = ИмяРисункаЭЦПВТабличномДокументе();
	
	ИмяSVG = ПолучитьИмяВременногоФайла("svg");
	ТекстДок = Новый ТекстовыйДокумент;
	ТекстДок.УстановитьТекст(ДанныеКартинки.ТекстКартинки);
	ТекстДок.Записать(ИмяSVG);
	
	Рисунок.Картинка = Новый Картинка(ИмяSVG);
	Рисунок.Расположить(ТабличныйДокумент.Область(ПараметрыРисунка.Расположение));
	ЗаполнитьЗначенияСвойств(Рисунок, ПараметрыРисунка);
	Рисунок.Верх = Рисунок.Верх + ПараметрыРисунка.СдвигВерх;
	Рисунок.Лево = Рисунок.Лево + ПараметрыРисунка.СдвигЛево;
	
КонецПроцедуры

Функция СформироватьПараметрыРисунка(ТабличныйДокумент, ПараметрыЭЦП, ДанныеКартинки, РасположениеПодписи, ВысотаТаблицы)
	
	ПараметрыРисунка = ПолучитьПараметрыРисункаПоУмолчанию();
	
	стрШирина = НСтр(ПараметрыЭЦП, "Ширина");
	
	Если ЗначениеЗаполнено(стрШирина)
		И Число(стрШирина) > 0
	Тогда
		ПараметрыРисунка.Ширина = Число(стрШирина);
	КонецЕсли;
	
	ПараметрыРисунка.Высота = ДанныеКартинки.ВысотаТаблицы*ПараметрыРисунка.Ширина/ДанныеКартинки.ШиринаТаблицы;
	
	Если РасположениеПодписи = Перечисления.РасположениеПодписи.ПоЗаданнымКоординатам Тогда
		стрРасположение	= Нстр(ПараметрыЭЦП, "КоордРасположение");
		стрСдвигВерх	= НСтр(ПараметрыЭЦП, "КоордВерх");
		стрСдвигЛево	= НСтр(ПараметрыЭЦП, "КоордЛево");
	Иначе
		стрРасположение	= СтрШаблон("R%1C1", ВысотаТаблицы+1);
		стрСдвигВерх	= НСтр(ПараметрыЭЦП, "ПослеВерх");
		стрСдвигЛево	= НСтр(ПараметрыЭЦП, "ПослеЛево");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стрРасположение) Тогда
		ПараметрыРисунка.Расположение = стрРасположение;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стрСдвигВерх) Тогда
		ПараметрыРисунка.СдвигВерх = Число(стрСдвигВерх);
	КонецЕсли;
	
	Если ЗначениеЗаполнено(стрСдвигЛево) Тогда
		ПараметрыРисунка.СдвигЛево = Число(стрСдвигЛево);
	КонецЕсли;
	
	Возврат ПараметрыРисунка;
	
КонецФункции

Функция ПолучитьПараметрыРисункаПоУмолчанию()
	
	ПараметрыРисунка = Новый Структура;
	
	ПараметрыРисунка.Вставить("СдвигВерх",		0);
	ПараметрыРисунка.Вставить("СдвигЛево",		0);
	ПараметрыРисунка.Вставить("Ширина",			50);
	ПараметрыРисунка.Вставить("Узор",			ТипУзораТабличногоДокумента.БезУзора);
	ПараметрыРисунка.Вставить("Линия",			Новый Линия(ТипЛинииРисункаТабличногоДокумента.НетЛинии));
	ПараметрыРисунка.Вставить("Расположение",	"R1C1");
	ПараметрыРисунка.Вставить("Высота",			11);
	
	Возврат ПараметрыРисунка;
	
КонецФункции

Функция СформироватьДанныеКартинкиСертификатаSVG(ДанныеПодписи) Экспорт
	
	ШаблонКартинки =
		"<?xml version='1.0' encoding='UTF-8' standalone='no'?>
		|<svg width='%1' height='%2' xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' version='1.2' baseProfile='tiny'>
		|	<g fill='none' opacity='%5' stroke='black' fill-rule='evenodd' stroke-linecap='butt' stroke-linejoin='bevel'>
		|		<g fill='#000090' stroke='none'>
		|			%3
		|		</g>
		|		<g fill='#000000' stroke='none' font-style='normal' font-family='Consolas' font-size='5' font-weight='Bold'>
		|			%4
		|		</g>
		|	</g>
		|</svg>";
	
	ПараметрыТаблицы = ПолучитьПараметрыТаблицыЭЦП();
	
	СтрокиСерийногоНомера	= ПолучитьМассивСтрокДляТаблицыЭЦП(ДанныеПодписи.Сертификат,				ПараметрыТаблицы.ДлинаУзкойСтроки);
	СтрокиДанныхВладельца	= ПолучитьМассивСтрокДляТаблицыЭЦП(ДанныеПодписи.ВладелецСертификата,		ПараметрыТаблицы.ДлинаУзкойСтроки,	 ПараметрыТаблицы.Разделители);
	СтрокиНаименования		= ПолучитьМассивСтрокДляТаблицыЭЦП(ДанныеПодписи.НаименованиеОрганизации,	ПараметрыТаблицы.ДлинаШирокойСтроки, ПараметрыТаблицы.Разделители);
	
	ДатыЭЦП = Новый Структура("ДействительностьСертификатаНачало, ДействительностьСертификатаОкончание, ДатаПодписи");
	ЗаполнитьЗначенияСвойств(ДатыЭЦП, ДанныеПодписи);
	
	ТекстЛиний = ПолучитьТекстЛинийКартинкиЭЦП(СтрокиСерийногоНомера, СтрокиДанныхВладельца, СтрокиНаименования, ПараметрыТаблицы.ВысотаТаблицы);
	ТекстДанных = ПолучитьТекстДанныхКартинкиЭЦП(СтрокиСерийногоНомера, СтрокиДанныхВладельца, СтрокиНаименования, ДатыЭЦП);
	
	ТекстКартинки = СтрШаблон(ШаблонКартинки, ПараметрыТаблицы.ШиринаТаблицы, ПараметрыТаблицы.ВысотаТаблицы, ТекстЛиний, ТекстДанных, ПараметрыТаблицы.Прозрачность);
	
	Возврат Новый Структура("ТекстКартинки, ШиринаТаблицы, ВысотаТаблицы", ТекстКартинки, ПараметрыТаблицы.ШиринаТаблицы, ПараметрыТаблицы.ВысотаТаблицы);
	
КонецФункции

Функция ПолучитьПараметрыТаблицыЭЦП()
	
	Параметры = Новый Структура;
	Параметры.Вставить("ШиринаТаблицы",		 183);
	Параметры.Вставить("ВысотаТаблицы",		 41);
	Параметры.Вставить("ДлинаУзкойСтроки",	 53);
	Параметры.Вставить("ДлинаШирокойСтроки", 65);
	Параметры.Вставить("Прозрачность",		 1);
	
	Параметры.Вставить("Разделители", " " + Символы.НПП + Символы.Таб);
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьМассивСтрокДляТаблицыЭЦП(Знач Значение, ДлинаСтроки, Разделители = Неопределено) Экспорт
	
	Строки = Новый Массив;
	
	Значение = СтрЗаменить(Значение, Символы.ПС,	"");
	Значение = СтрЗаменить(Значение, Символы.ВТаб,	"");
	Значение = СтрЗаменить(Значение, Символы.ВК,	"");
	
	Если Разделители = Неопределено Тогда
		
		Пока ЗначениеЗаполнено(Значение) Цикл
			Строка = Лев(Значение, ДлинаСтроки);
			Строки.Добавить(Строка);
			Значение = СокрЛП(Прав(Значение, СтрДлина(Значение) - ДлинаСтроки));
		КонецЦикла;
	Иначе
		
		Слова = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивСлов(Значение, Разделители);
		Строка = "";
		
		Для Каждого Слово Из Слова Цикл
			Если СтрДлина(СтрШаблон("%1 %2", Строка, Слово)) > ДлинаСтроки Тогда
				Строки.Добавить(Строка);
				Строка = Слово;
			ИначеЕсли Строка = "" Тогда
				Строка = Слово;
			Иначе
				Строка = СтрШаблон("%1 %2", Строка, Слово);
			КонецЕсли;
		КонецЦикла;
		
		Если ЗначениеЗаполнено(Строка) Тогда
			Строки.Добавить(Строка);
		КонецЕсли;
	КонецЕсли;
	
	Если Строки.Количество() = 0 Тогда
		Строки.Добавить("");
	КонецЕсли;
	
	Возврат Строки;
	
КонецФункции

Функция ПолучитьТекстЛинийКартинкиЭЦП(СтрокиСерийногоНомера, СтрокиДанныхВладельца, СтрокиНаименования, ВысотаТаблицы)
	
	ВысотаСтрокСерийногоНомера	= 6*(СтрокиСерийногоНомера.Количество()-1);
	ВысотаСтрокДанныхВладельца	= 6*(СтрокиДанныхВладельца.Количество()-1);
	ВысотаСтрокНаименования		= 6*(СтрокиНаименования.Количество()-1);
	
	ВысотаЛинииСерийногоНомера	= 17 + ВысотаСтрокСерийногоНомера;
	ВысотаЛинииДанныхВладельца	= 25 + ВысотаСтрокСерийногоНомера + ВысотаСтрокДанныхВладельца;
	ВысотаЛинииНаименования		= 33 + ВысотаСтрокСерийногоНомера + ВысотаСтрокДанныхВладельца;
	
	ВысотаТаблицы = ВысотаТаблицы + ВысотаСтрокСерийногоНомера + ВысотаСтрокДанныхВладельца + ВысотаСтрокНаименования;
	
	СтрокиЛиний = Новый Массив;
	СтрокиЛиний.Добавить("<path d='M0,0 L182,0 L182,1 L0,1'/>");																			// Горизонтальная верхняя
	СтрокиЛиний.Добавить("<path d='M0,8 L182,8 L182,9 L0,9'/>");																			// Горизонтальная между заголовком и сертификатом
	СтрокиЛиний.Добавить(СтрШаблон("<path d='M0,%1 L182,%1 L182,%2 L0,%2'/>",	ВысотаТаблицы-1, ВысотаТаблицы));							// Горизонтальная нижняя
	СтрокиЛиний.Добавить(СтрШаблон("<path d='M0,0 L1,0 L1,%1 L0,%1'/>",			ВысотаТаблицы));											// Вертикальная левая
	СтрокиЛиний.Добавить(СтрШаблон("<path d='M183,0 L182,0 L182,%1 L183,%1'/>",	ВысотаТаблицы));											// Вертикальная правая
	СтрокиЛиний.Добавить(СтрШаблон("<path d='M0,%1 L182,%1 L182,%2 L0,%2'/>",	ВысотаЛинииСерийногоНомера-1, ВысотаЛинииСерийногоНомера));	// Горизонтальная между сертификатом и владельцем
	СтрокиЛиний.Добавить(СтрШаблон("<path d='M0,%1 L182,%1 L182,%2 L0,%2'/>",	ВысотаЛинииДанныхВладельца-1, ВысотаЛинииДанныхВладельца));	// Горизонтальная между владельцем и датами
	СтрокиЛиний.Добавить(СтрШаблон("<path d='M0,%1 L182,%1 L182,%2 L0,%2'/>",	ВысотаЛинииНаименования-1, ВысотаЛинииНаименования));		// Горизонтальная между датами и наименованием организации
	СтрокиЛиний.Добавить(СтрШаблон("<path d='M33,8 L34,8 L34,%1 L33,%1'/>",		ВысотаЛинииДанныхВладельца));								// Вертикальная внутренняя
	
	Возврат СтрСоединить(СтрокиЛиний, Символы.ПС);
	
КонецФункции

Функция ПолучитьТекстДанныхКартинкиЭЦП(СтрокиСерийногоНомера, СтрокиДанныхВладельца, СтрокиНаименования, Даты)
	
	СтрокиДанных = Новый Массив;
	СтрокиДанных.Добавить("<text x='38' y='6'>ДОКУМЕНТ ПОДПИСАН ЭЛЕКТРОННОЙ ПОДПИСЬЮ</text>"); // Заголовок
	
	// Сертификат
	СтрокиДанных.Добавить("<text x='2' y='14'>Сертификат</text>");
	ТекСтрока = 0;
	Для Каждого СтрокаДанных Из СтрокиСерийногоНомера Цикл
		СтрокиДанных.Добавить(СтрШаблон("<text x='35' y='%1'>%2</text>", 14+6*ТекСтрока, СтрокаДанных));
		ТекСтрока = ТекСтрока + 1;
	КонецЦикла;
	
	ДопВысота = 6*СтрокиСерийногоНомера.ВГраница();
	
	// Владелец
	СтрокиДанных.Добавить(СтрШаблон("<text x='2' y='%1'>Владелец</text>", 22+ДопВысота+6*СтрокиДанныхВладельца.ВГраница()/2));
	ТекСтрока = 0;
	Для Каждого СтрокаДанных Из СтрокиДанныхВладельца Цикл
		СтрокиДанных.Добавить(СтрШаблон("<text x='35' y='%1'>%2</text>", 22+ДопВысота+6*ТекСтрока, СтрокаДанных));
		ТекСтрока = ТекСтрока + 1;
	КонецЦикла;
	
	ДопВысота = ДопВысота + 6*СтрокиДанныхВладельца.ВГраница();
	
	// Даты
	СтрокиДанных.Добавить(СтрШаблон("<text x='2' y='%1'>Действителен с %2 по %3. Дата подписи: %4</text>", 30+ДопВысота, Даты.ДействительностьСертификатаНачало, Даты.ДействительностьСертификатаОкончание, Даты.ДатаПодписи));
	
	// Наименование организации
	ТекСтрока = 0;
	Для Каждого СтрокаДанных Из СтрокиНаименования Цикл
		СтрокиДанных.Добавить(СтрШаблон("<text x='2' y='%1'>%2</text>", 38+ДопВысота+6*ТекСтрока, СтрокаДанных));
		ТекСтрока = ТекСтрока + 1;
	КонецЦикла;
	
	Возврат СтрСоединить(СтрокиДанных, Символы.ПС);
	
КонецФункции

Процедура СертификатыЭЦППриЗаписи(Источник, Отказ) Экспорт
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти
